; -----------------------------------------------------------------------------
; 一个返回浮点数数组元素和的 64 位程序。
; 函数声明如下:
;
;   double sum(double[] array, uint64_t length)
; -----------------------------------------------------------------------------

        global  sum
        section .text
sum:
        xorsd   xmm0, xmm0              ; 初始化累加和为 0
        cmp     rsi, 0                  ; 考虑数组长度为 0 的特殊情形
        je      done
next:
        addsd   xmm0, [rdi]             ; 累加当前数组元素的值
        add     rdi, 8                  ; 指向下一个数组元素
        dec     rsi                     ; 计数器递减
        jnz     next                    ; 如果没有结束递减则继续累加
done:
        ret                             ; 返回保存在 xmm0 寄存器中的值
